wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20181209.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_USART.H"

#include "STM32_GPIO.H"
//#include "STM32_SYSTICK.H"
#include 	"LinkedList.H"

#include "stm32f10x_dma.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_rcc.h"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


/*##############################################################################
################################################################################
设置波特率时的误差计算
--------------------------------------------------------------------------------
波特率				|fPCLK = 36MHz	误差%			|		fPCLK = 72MHz	误差%			|
--------------------------------------------------------------------------------
2400				|						0%						|						0%							
--------------------------------------------------------------------------------
9600				|						0%						|						0%								
--------------------------------------------------------------------------------
19200				|						0%						|						0%							
--------------------------------------------------------------------------------
57600				|						0%						|						0%							
--------------------------------------------------------------------------------
115200			|						0.15%					|						0%							
--------------------------------------------------------------------------------
230400			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
460800			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
921600			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
2250000			|						0%						|						0%							
--------------------------------------------------------------------------------

################################################################################
###############################################################################*/

//--------USART全局变量定义
#define	uRxSize		512				//默认串口DMA接收缓冲大小,如果配置时未输入缓存大小时使用的默认值
#define	uTxSize		uRxSize		//默认串口DMA发送缓冲大小
#define	uBaudRate	115200	//默认串口波特率
unsigned char uRx1Addr[uRxSize]	=	{0};					//串口1接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx2Addr[uRxSize]	=	{0};					//串口2接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx3Addr[uRxSize]	=	{0};					//串口3接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx4Addr[uRxSize]	=	{0};					//串口4接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址

//unsigned char uTx1Addr[uTxSize]	=	{0};					//串口1发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
//unsigned char uTx2Addr[uTxSize]	=	{0};					//串口2发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
//unsigned char uTx3Addr[uTxSize]	=	{0};					//串口3发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
//unsigned char uTx4Addr[uTxSize]	=	{0};					//串口4发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送

//unsigned char *uRx1Addr;					//串口1接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
//unsigned char *uRx2Addr;					//串口2接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
//unsigned char *uRx3Addr;					//串口3接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
//unsigned char *uRx4Addr;					//串口4接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址

unsigned char *uTx1Addr;					//串口1发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char *uTx2Addr;					//串口2发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char *uTx3Addr;					//串口3发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char *uTx4Addr;					//串口4发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送


//static LINK_NODE *uRxLink1  = NULL;   //USART1接收链表
//static LINK_NODE *uRxLink2  = NULL;   //USART2接收链表
//static LINK_NODE *uRxLink3  = NULL;   //USART3接收链表
//static LINK_NODE *uRxLink4  = NULL;   //UART4接收链表
//static LINK_NODE *uRxLink5  = NULL;   //UART5接收链表

static LINK_NODE *uTxLink1  = NULL;   //USART1发送链表
static LINK_NODE *uTxLink2  = NULL;   //USART2发送链表
static LINK_NODE *uTxLink3  = NULL;   //USART3发送链表
static LINK_NODE *uTxLink4  = NULL;   //UART4发送链表
//static LINK_NODE *uTxLink5  = NULL;   //UART5发送链表


static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}SetDmaSize;      //配置时设置的DMA接收缓存大小
static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}RemaDmaSize;     //DMA开启后剩余DMA接收缓存大小，通过与设置的DMA缓存大小来判断数据是否在接收
static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}RetryCount;
//static unsigned short gUSART1_BufferSizebac=0;		//串口1DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUSART2_BufferSizebac=0;		//串口2DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUSART3_BufferSizebac=0;		//串口3DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUART4_BufferSizebac=0;			//串口4DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUART5_BufferSizebac=0;			//----无DMA

//static unsigned short gUSART1_BufferSizeRema=0;		//串口1DMA缓冲大小剩余
//static unsigned short gUSART2_BufferSizeRema=0;		//串口2DMA缓冲大小剩余
//static unsigned short gUSART3_BufferSizeRema=0;		//串口3DMA缓冲大小剩余
//static unsigned short gUART4_BufferSizeRema=0;		//串口4DMA缓冲大小剩余
//static unsigned short gUART5_BufferSizeRema=0;		//----无DMA

