wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20181209.C
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void	RS485_DMA_ConfigurationNR(
																RS485Def *pRS485,	//包含RS485选用的串口号和收发控制脚信息
																u32 USART_BaudRate,					//波特率
																u16 BufferSize							//设定接收缓冲区大小
)	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
{
	USART_DMA_ConfigurationNR	(pRS485->USARTx,USART_BaudRate,BufferSize);		//USART_DMA配置--查询方式，不开中断
	GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_CTL_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	pRS485->RS485_CTL_PORT->BRR 		= pRS485->RS485_CTL_Pin;				//RS485接收开启
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void	RS485_DMA_ConfigurationNRRemap(
																RS485Def *pRS485,	//包含RS485选用的串口号和收发控制脚信息
																u32 USART_BaudRate,					//波特率
																u32 *RXDBuffer,							//接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
																u32 BufferSize							//设定接收缓冲区大小
)	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
{
	USART_DMA_ConfigurationNRRemap	(pRS485->USARTx,USART_BaudRate,RXDBuffer,BufferSize);		//USART_DMA配置--查询方式，不开中断
	GPIO_Configuration_OPP50				(pRS485->RS485_CTL_PORT,pRS485->RS485_CTL_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	pRS485->RS485_CTL_PORT->BRR 		= pRS485->RS485_CTL_Pin;				//RS485接收开启
}
/*******************************************************************************
*函数名			:	RS485_ReadBufferIDLE
*功能描述		:	串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
*输入				: 
*返回值			:	无
*******************************************************************************/
u16	RS485_ReadBufferIDLE(
												RS485Def *pRS485,	//包含RS485选用的串口号和收发控制脚信息
												u8 *RevBuffer								//数据保存缓冲区地址，如果串口的接收到数据，将数据拷贝到RevBuffer
)	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer，
{
	u16 length=0;
	USARTStatusDef	Status;
	Status	=	USART_Status(pRS485->USARTx);		//串口状态检查
	
	if(0  ==  Status.USART_IDLESTD)		//bit[0] 0-串口空闲；1-串口非空闲，状态根据以下位定义
	{
		RS485_RX_EN(pRS485);
		length=USART_ReadBufferIDLE(pRS485->USARTx,RevBuffer);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	}
	return length;
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
u16	RS485_DMAPrintf(RS485Def *pRS485,const char *format,...)						//自定义printf串口DMA发送程序,后边的省略号就是可变参数
{
		
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );
	
//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
//	if(DMAPrintf_Buffer!=NULL)
//	{
//		free(DMAPrintf_Buffer);						//释放动态空间
//	}
//	u8	*USART_BUFFER;
	//1)**********获取数据宽度
	u32 num=strlen((const char*)format);		//获取数据宽度
	//2)**********定义缓冲区大小变量
	unsigned int BufferSize;
	unsigned char DMAPrintf_Buffer[256]={0};
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
	free(DMAPrintf_Buffer);						//释放动态空间
//	DMAPrintf_Buffer=NULL;
	//4)**********申请动态空间
//	DMAPrintf_Buffer = (char*)malloc(sizeof(char) * num);	
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	BufferSize = vsprintf((char*)DMAPrintf_Buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	BufferSize=RS485_DMASend(pRS485,(u8*)DMAPrintf_Buffer,BufferSize);	//RS485-DMA发送程序
	return BufferSize;			//返回发送数据大小

}
/*******************************************************************************
*函数名			:	USART_DMASend
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
u16 RS485_DMASend(
									RS485Def *pRS485,		//包含RS485选用的串口号和收发控制脚信息
									u8 *tx_buffer,								//待发送数据缓冲区地址
									u16 BufferSize								//设定发送数据大小
)		//RS485-DMA发送程序
{
	//----发送前检查相关串口发送状态，如果下在发送其它数据，则等待（返回0），否则清除相关标志位后开启发送
	
//	u32	DMA_status=0;			//DMA状态	
	USARTStatusDef	Status;
	USART_TypeDef* USARTx=pRS485->USARTx;
	
	Status	=	USART_Status(USARTx);		//串口状态检查
	if(1  ==  Status.USART_IDLESTD)   //bit[0] 0-串口空闲；1-串口非空闲，状态根据以下位定义
	{
		return 0;
	}
//	SysTick_DeleymS(1);				//SysTick延时nmS
	RS485_TX_EN(pRS485);
//	USART_DMASend	(USARTx,(u8*)tx_buffer,BufferSize);		//串口DMA发送程序
	USART_DMASend(USARTx,(u8*)tx_buffer,BufferSize);		//串口DMA发送程序
	return 0;
}




/*******************************************************************************
*函数名			:	USART_ConfigurationIT
*功能描述		:	USART_配置---常规中断方式
*输入				: 
*返回值			:	无
*修改时间		:	2018/01/06
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void	USART_ConfigurationIT(
																USART_TypeDef* USARTx,			//串口号--USART1,USART2,USART3,UART4;//UART5不支持DMA
																u32 USART_BaudRate,					//波特率
																u8 PreemptionPriority,			//中断优先级
																u8 SubPriority							//抢占优先级
)	//USART_DMA配置--查询方式，不开中断--奇校验
{
	//1)**********定义变量	

	NVIC_InitTypeDef NVIC_InitStructure;
	USART_InitTypeDef USART_InitStructure;				//USART结构体	
	GPIO_InitTypeDef GPIO_InitStructure;					//GPIO结构体

	
	u16 TXD_Pin=0;																//串口发送脚
	u16 RXD_Pin=0;																//串口接收脚
	GPIO_TypeDef* GPIO_TX=0;
	GPIO_TypeDef* GPIO_RX=0;
	
